read_verilog -sv -formal -overwrite {workspace}/cpu.v
design -reset-vlog; proc;
write_json {workspace}/netlist/cpu.json