read_verilog -sv -formal -overwrite {workspace}/mem.v
design -reset-vlog; proc;
write_json {workspace}/netlist/mem.json